===========
advanced/D#
===========
--- metac
+++ metacp
                   type_ref {
                     prefix {
-                    symbol: "local8"
+                    symbol: "advanced/D#_$2#"
             declarations {
               hardlinks {
-                symbol: "local8"
+                symbol: "advanced/D#_$2#"
                 kind: TYPE
                 properties: 4
                 display_name: "_"
     declarations {
       symlinks: "advanced/D#`<init>`()."
+      symlinks: "advanced/D#_$2#"


==========================
advanced/Existential#e1().
==========================
--- metac
+++ metacp
               type_ref {
                 prefix {
-                symbol: "local4"
+                symbol: "local0"
         declarations {
           hardlinks {
-            symbol: "local4"
+            symbol: "local0"
             kind: TYPE
             properties: 4
             display_name: "_"


==========================
advanced/Existential#e2().
==========================
--- metac
+++ metacp
                   type_ref {
                     prefix {
-                    symbol: "local5"
+                    symbol: "local1"
             declarations {
               hardlinks {
-                symbol: "local5"
+                symbol: "local1"
                 kind: TYPE
                 properties: 4
                 display_name: "T"


==========================
advanced/Existential#e4().
==========================
--- metac
+++ metacp
           type_ref {
             prefix {
-            symbol: "local6"
+            symbol: "local2"
             type_arguments {
               type_ref {
                 prefix {
         declarations {
           hardlinks {
-            symbol: "local6"
+            symbol: "local2"
             kind: TYPE
             properties: 4
             display_name: "U"
                     type_parameters {
                       hardlinks {
-                        symbol: "local7"
+                        symbol: "local3"
                         kind: TYPE_PARAMETER
                         properties: 0
                         display_name: "T"


=================
advanced/Test.e2.
=================
--- metac
+++ metacp
                   type_ref {
                     prefix {
-                    symbol: "local5"
+                    symbol: "advanced/Test.T#"
             declarations {
               hardlinks {
-                symbol: "local5"
+                symbol: "advanced/Test.T#"
                 kind: TYPE
                 properties: 4
                 display_name: "T"


==============
annot/Alias.A#
==============
--- metac
+++ metacp
         annotations {
           tpe {
-            type_ref {
-              prefix {
-              symbol: "scala/annotation/meta/param#"
         annotations {
           tpe {
-            type_ref {
-              prefix {
-              symbol: "scala/annotation/meta/param#"


============================
classes/C3#copy$default$1().
============================
--- metac
+++ metacp
         annotations {
           tpe {
-            type_ref {
-              prefix {
-              symbol: "scala/annotation/unchecked/uncheckedVariance#"


============================
classes/C4#copy$default$1().
============================
--- metac
+++ metacp
         annotations {
           tpe {
-            type_ref {
-              prefix {
-              symbol: "scala/annotation/unchecked/uncheckedVariance#"


============================
classes/C6#copy$default$1().
============================
--- metac
+++ metacp
         annotations {
           tpe {
-            type_ref {
-              prefix {
-              symbol: "scala/annotation/unchecked/uncheckedVariance#"


====================
classes/N.anonClass.
====================
--- metac
+++ metacp
         declarations {
           hardlinks {
-            symbol: "local8"
+            symbol: "local0"
             kind: METHOD
             properties: 1024
             display_name: "local"


===============
example/Access#
===============
--- metac
+++ metacp
       symlinks: "example/Access#`<init>`()."
       symlinks: "example/Access#m1()."
       symlinks: "example/Access#m2()."
-      symlinks: "example/Access#m3()."
       symlinks: "example/Access#m4()."
       symlinks: "example/Access#m5()."
       symlinks: "example/Access#m6()."
       symlinks: "example/Access#m7()."
+      symlinks: "example/Access#m3()."


======================================
example/InstrumentTyper#AnnotatedType#
======================================
--- metac
+++ metacp
         annotations {
           tpe {
-            type_ref {
-              prefix {
-              symbol: "scala/annotation/meta/param#"
         annotations {
           tpe {
-            type_ref {
-              prefix {
-              symbol: "scala/annotation/meta/param#"


======================================
example/InstrumentTyper#existential().
======================================
--- metac
+++ metacp
           type_ref {
             prefix {
-            symbol: "local1"
+            symbol: "local0"
             type_arguments {
               type_ref {
                 prefix {
         declarations {
           hardlinks {
-            symbol: "local1"
+            symbol: "local0"
             kind: TYPE
             properties: 4
             display_name: "U"
                     type_parameters {
                       hardlinks {
-                        symbol: "local2"
+                        symbol: "local1"
                         kind: TYPE_PARAMETER
                         properties: 0
                         display_name: "T"


=========================
example/Methods#m13().(x)
=========================
--- metac
+++ metacp
 signature {
   value_signature {
     tpe {
-      annotated_type {
-        tpe {
-          type_ref {
-            prefix {
-            symbol: "scala/Int#"
+      type_ref {
+        prefix {
-        annotations {
-          tpe {
-            type_ref {
-              prefix {
-              symbol: "scala/unchecked#"
+        symbol: "scala/Int#"


================================
example/Methods#m19$default$2().
================================
--- metac
+++ metacp
         annotations {
           tpe {
-            type_ref {
-              prefix {
-              symbol: "scala/annotation/unchecked/uncheckedVariance#"


================================
example/Methods#m19$default$3().
================================
--- metac
+++ metacp
         annotations {
           tpe {
-            type_ref {
-              prefix {
-              symbol: "scala/annotation/unchecked/uncheckedVariance#"


======================
example/Synthetic#x$2.
======================
--- metac
+++ metacp
 access {
-  public_access {
+  private_this_access {


======================
types/Test.C#annType1.
======================
--- metac
+++ metacp
         annotations {
           tpe {
-            type_ref {
-              prefix {
-              symbol: "types/ann#"
-              type_arguments {
-                type_ref {
-                  prefix {
-                  symbol: "scala/Int#"


======================
types/Test.C#annType2.
======================
--- metac
+++ metacp
         annotations {
           tpe {
-            type_ref {
-              prefix {
-              symbol: "types/ann1#"
         annotations {
           tpe {
-            type_ref {
-              prefix {
-              symbol: "types/ann2#"


============================
types/Test.Literal.javaEnum.
============================
--- metac
+++ metacp
 display_name: "javaEnum"
 language: SCALA
 signature {
-  method_signature {
-    type_parameters {
-    return_type {
-      single_type {
-        prefix {
-        symbol: "java/nio/file/LinkOption#NOFOLLOW_LINKS."
 access {
   public_access {


